import {Page} from '@/components/Page'
import {Title} from '@/components/Title'
import {Image} from '@/components/Image'

type Props = {
  pageNumber: number
}

export function ShiratamaIori({pageNumber}: Props) {
  return (
    <div id={'shiratamaIori'}>
      <Page pageNumber={pageNumber}>
        <Title
          title={'メイド喫茶店員がガールズバーに転生してみた'}
          description={'これが本当の異世界転生'}
          name={'白玉いおり'}
          image={'/2024/authors/shiratamaIori.jpg'}
          titleFontSize={'1.53rem'}
          linkX={'iori_nnnn'}
        />
        <section>
          <p>
            17才の頃から秋葉原のメイド喫茶で初お給仕から早や10年…
          </p>
          <p>
            色んな店舗でたくさんのオタクを見てきました。
            そんな私が秋葉時代の先輩に誘われ、下町のガールズバーでお手伝いさせて頂くことになりました。
          </p>
          <p>タイトルに転生とあるのですが、この萌産業(メイド喫茶、コンカフェ、リフレ等)お店を変えて別のお店で働くことを転生というのです。</p>
          <p>
            メイドカフェに通うご主人様はお酒を飲まない方やキャストさんとの乾杯ドリンクを嫌がるお客様も多く、転生しても下町のガルバに応援に来てくれる方は相当私のことを好きでないと来てくれません。
            なので、たくさん出勤して地元のお客様を捕まえることに専念した。そこで出会った変わったお客様についてご紹介します。
          </p>
        </section>
        <section>
          <h2>ラム酒出禁スレスレおじさん</h2>
          <p>
            多分私の母親と同い年くらいだと思う。
            口が悪く、会話の内容は女の子の悪口や下ネタと最悪である。
            そして彼はラム酒を好んで飲む為、ボトルキープの毎週ラム酒を1本枯らして帰る。それを女の子が飲むと非常に喜ぶのである。
            あまりいい飲み方ではないので近所で出禁になってるお店がたくさんある。
            私は何度もこのラム酒で記憶を飛ばしている。だけど無理して飲んだ甲斐があり、元々3千円くらいで帰るラム酒おじさんが1日3万円は使って帰るようになったのだ！
            彼はLINEなどではあまり話をしない。プライベートでめんどくさくないタイプで営業しなくても来るのでその辺は非常にありがたかった。
          </p>
          <p>
            お店で色々話を聞いていると実はVtuberが好きだったり、オタク趣味があったり寄り添うことであまり人に話さないことを話してくれるようになった。
            私も本音話してみよっかなと思って。ベロベロに酔ってもう死んじゃいたいくらい辛いことがあったの(筆者はメンヘラである)
            冗談で今日の営業終わりに樹海に行くと言ったことがあった。
          </p>
          <p>
            そしたらラム酒おじさんは樹海に行く前に1回ヤらせろ、胸糞悪いけど1回ヤったら好きに樹海でも行きなよって彼なりに励まして？くれたのかな。 <b>こいつ最悪だ</b> と思った
          </p>
        </section>
        <section>
          <h2>スク水ローターおじさん</h2>
          <p>
            このおじさんは元々別の女の子指名のお客様で、その女の子が辞めてしまいずっとフリーで通っていた。
            作業着？のような格好でいつも夜中の2時頃現れる。指には結婚指輪。
            作業着のような格好の下にはスクール水着を着用して来店するのだ。
            130センチくらいキツい水着を着ると締め付けが気持ちいいらしい。
          </p>
        </section>
      </Page>
      <Page pageNumber={pageNumber + 1}>
        <section>
          <p>…130センチの水着？
            それって大人用じゃないよね？と聞いたらオークションサイトで売られている使用済みしか買わないと胸を張っていた。</p>
          <Image height={'38mm'} src={'/2024/shiratamaIori/1.png'}
                 alt={'妻子持ちの為(…ええ…) 洗濯ができないのですごく臭い 本当に臭い'}/>
          <p>そんな感じで性癖を否定せずに話を聞いてあげていたら指名を貰うようになった。</p>
          <p>ある日、私にスク水おじさんから差し入れがあり…紙袋の中にはスクール水着とピンクローターが入っていた……お店に相談したけど受け取った自分が悪いとしか言われなかった。断れない私はおじさんからの差し入れが増えていくので私の家は女児水着やスク水、フェチ系のビデオだらけでです………</p>
          <p>後から判明したのですが、作業着のような格好はどこかの学校の体育着でした…</p>
        </section>
        <section>
          <h2>恐怖 ガチ恋おじさん</h2>
          <p>本当に恋は盲目だ……
            付き合ってもないし、セクハラツイート、店にも来ない、金も使わないのに毎朝モニコ(モーニングコール)を求めてくる。本名で呼んでくるし…。</p>
          {/*<p>本名で呼んでくるし…。なんかムカつくので皆様にも本名開示します。梨奈です。</p>*/}
          <Image height={'42mm'} src={'/2024/shiratamaIori/2.jpg'} alt={'なんかムカつくので皆様にも本名開示します。梨奈です。'}/>
          <p>
            今度実家に来て欲しい親に紹介したいと言われ…なんか勘違い？彼女でもないしキスすらした事ないよね？って言ったらリムられてました。
            今は貸した千円返せと悪口書かれてました。
          </p>
        </section>
        <section>
          <p>とこんな感じで…変わったお客様は多かったです…というか変わったおじさんを私が引き寄せてる感…  </p>
          <p>また人として強くなれました。ありがとうガールズバー…　　退職！！！！！！！！</p>
        </section>
      </Page>
    </div>
  )
}
